Load Libaries

In [23]:
import pandas as pd
import numpy as np

Load Dataset

In [24]:
data_set = 'crop_recommendation.csv'

Find Info

In [25]:
df = pd.read_csv(data_set)

In [26]:
df.shape

(2200, 9)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N            2200 non-null   int64
 1   P            2200 non-null   int64
 2   K            2200 non-null   int64
 3   temperature  2200 non-null   float64
 4   humidity     2200 non-null   float64
 5   ph           2200 non-null   float64
 6   rainfall     2200 non-null   float64
 7   CEC          2200 non-null   int64
 8   label        2200 non-null   object
dtypes: float64(4), int64(4), object(1)
memory usage: 154.8+ KB

In [28]:
df.head(3)

    N   P   K  temperature   humidity        ph    rainfall  CEC label
0  90  42  43    20.879744  82.002744  6.502985  202.935536   44  rice
1  85  58  41    21.770462  80.319644  7.038096  226.655537   42  rice
2  60  55  44    23.004459  82.320763  7.840207  263.964248   33  rice

In [29]:
df.tail(3)

        N   P   K  temperature   humidity        ph    rainfall  CEC   label
2197  118  33  30    24.131797  67.225123  6.362608  173.322839    7  coffee
2198  117  32  34    26.272418  52.127394  6.758793  127.175293    6  coffee
2199  104  18  30    23.603016  60.396475  6.779833  140.937041   44  coffee

Find Mean Max Std

In [30]:
#numeric data only
df.describe()

,N,P,K,temperature,humidity,ph,rainfall,CEC
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000
mean,50.551818,53.362727,48.149091,25.616244,71.481779,6.469480,103.463655,31.962273
std,36.917334,32.985883,50.647931,5.063749,22.263812,0.773938,54.958389,10.230137
min,0.000000,5.000000,5.000000,8.825675,14.258040,3.504752,20.211267,6.000000
25%,21.000000,28.000000,20.000000,22.769375,60.261953,5.971693,64.551686,28.000000
50%,37.000000,51.000000,32.000000,25.598693,80.473146,6.425045,94.867624,32.000000
75%,84.250000,68.000000,49.000000,28.561654,89.948771,6.923643,124.267508,39.000000
max,140.000000,145.000000,205.000000,43.675493,99.981876,9.935091,298.560117,44.000000

In [31]:
df.describe(include='all')

,N,P,K,temperature,humidity,ph,rainfall,CEC,label
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,22
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,rice
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100
mean,50.551818,53.362727,48.149091,25.616244,71.481779,6.469480,103.463655,31.962273,NaN
std,36.917334,32.985883,50.647931,5.063749,22.263812,0.773938,54.958389,10.230137,NaN
min,0.000000,5.000000,5.000000,8.825675,14.258040,3.504752,20.211267,6.000000,NaN
25%,21.000000,28.000000,20.000000,22.769375,60.261953,5.971693,64.551686,28.000000,NaN
50%,37.000000,51.000000,32.000000,25.598693,80.473146,6.425045,94.867624,32.000000,NaN
75%,84.250000,68.000000,49.000000,28.561654,89.948771,6.923643,124.267508,39.000000,NaN
max,140.000000,145.000000,205.000000,43.675493,99.981876,9.935091,298.560117,44.000000,NaN

In [32]:
df.head(2)

    N   P   K  temperature   humidity        ph    rainfall  CEC label
0  90  42  43    20.879744  82.002744  6.502985  202.935536   44  rice
1  85  58  41    21.770462  80.319644  7.038096  226.655537   42  rice

In [33]:
text_col = ['label']

for i in text_col:
    print(f'{i}:{df[i].dtype}')

label:object

Find Null Value

In [34]:
null= df.isnull().sum()
null[null>0].sort_values(ascending=False)
null

N              0
P              0
K              0
temperature    0
humidity       0
ph             0
rainfall       0
CEC            0
label          0
dtype: int64

Find Unique Values

In [35]:
print(f"label : {df['label'].unique()}")

label : ['rice' 'maize' 'chickpea' 'kidneybeans' 'pigeonpeas' 'mothbeans'
 'mungbean' 'blackgram' 'lentil' 'pomegranate' 'banana' 'mango' 'grapes'
 'watermelon' 'muskmelon' 'apple' 'orange' 'papaya' 'coconut' 'cotton'
 'jute' 'coffee']

    N   P   K  temperature   humidity        ph    rainfall  CEC label
0  90  42  43    20.879744  82.002744  6.502985  202.935536   44  rice
1  85  58  41    21.770462  80.319644  7.038096  226.655537   42  rice
2  60  55  44    23.004459  82.320763  7.840207  263.964248   33  rice